{
  "backend/main.mo": "Empty Motoko actor definition with no logic.",
  "feature_evidence.json": "Feature evidence report listing implemented romantic-site features and associated files and components.",
  "frontend-file-summaries.txt": "JSON-style text summarizing all frontend components, styles, hooks, and pages for the romantic site.",
  "frontend/index.css": "Tailwind base setup defining CSS variables for light/dark themes and applying global background and text styles.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx with a root div.",
  "frontend/src/App.tsx": "Root React component handling home/gallery navigation and rendering all major romantic sections and footer.",
  "frontend/src/components/FinalMessageSection.tsx": "Closing section showing a final Valentine message, signature, and decorative emojis inside a styled card.",
  "frontend/src/components/FloatingHeartsOverlay.tsx": "Animated overlay that spawns floating heart and emoji elements rising upward across the screen.",
  "frontend/src/components/HeroVideoSection.tsx": "Hero section showing one user‑uploaded romantic video with manual play/pause control and overlay text.",
  "frontend/src/components/MusicToggle.tsx": "Floating button enabling optional background music playback with graceful error handling.",
  "frontend/src/components/OpeningSection.tsx": "Intro section with a romantic greeting, animated heart, and several loving paragraphs addressed to Vedika.",
  "frontend/src/components/OurBestMemoriesSection.tsx": "Displays a framed featured photo with decorative floating hearts inside a revealable section.",
  "frontend/src/components/OurMemoriesBackgroundSection.tsx": "Shows a full-screen background image with dark overlay and a romantic text line.",
  "frontend/src/components/ProposalSection.tsx": "Renders an interactive Valentine proposal with a 'yes' button and an evasive 'no' button, plus a success state with animations.",
  "frontend/src/components/SectionShell.tsx": "Provides a wrapper section that triggers a visible class on scroll using IntersectionObserver.",
  "frontend/src/components/SoftHeartsOverlay.tsx": "Generates floating heart emojis that animate upward for a soft ambient overlay.",
  "frontend/src/components/SorrySection.tsx": "Shows an apology message section with styled text and emotional paragraphs.",
  "frontend/src/components/VideosSection.tsx": "Displays clickable gradient cards representing memories, navigating to a gallery on click.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useEvasiveNoButton.ts": "Handles movement and teasing text for a button that dodges user interaction.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state and provides login and clearing functions via context.",
  "frontend/src/hooks/useRevealOnScroll.ts": "Returns a ref and visibility state triggered when an element enters the viewport.",
  "frontend/src/index.css": "Defines global Tailwind styles, romantic color variables, gradients, frames, and custom animations.",
  "frontend/src/main.tsx": "Bootstraps the app with React, query client, and Internet Identity provider.",
  "frontend/src/pages/GalleryPage.tsx": "React page that displays a curated list of five user-provided photos in a romantic grid with a back button, soft overlays, and themed styling.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, fonts, and container settings for a romantic theme, with plugins for animations and typography.",
  "project_state.json": "Project metadata describing the SPA’s romantic React/Tailwind structure, features, and versioned capability list."
}