{
  "kind": "build_request",
  "title": "Redeploy app to a fresh live instance without any code or content changes",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Deploy the application to a fresh live instance while keeping the exact same configuration and content (no changes to source code, assets, canister logic, or user-facing text).",
      "target": "unknown",
      "source": {
        "messageIds": [
          "recent-messages-3"
        ],
        "quotes": [
          "Please deploy this app using a fresh live instance.\nKeep the same configuration and content."
        ]
      },
      "acceptanceCriteria": [
        "A new live deployment is created (fresh instance) and is reachable via a live URL.",
        "No source code files, assets, or configuration values are modified as part of this change.",
        "The deployed app behavior and content match the prior live deployment (no functional or copy changes)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "If the deployment fails after a successful build, retry deployment using the current build artifacts without rebuilding and without changing any app logic/content.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "project_state.json-6..8"
        ],
        "quotes": [
          "Deployment failed after successful build; user requests retry deployment and fallback redeploy using last successful build without changing app logic/content."
        ]
      },
      "acceptanceCriteria": [
        "On deployment failure, the system performs at least one retry using the same build artifacts (no rebuild).",
        "The retry does not introduce any code/config/content changes."
      ]
    },
    {
      "id": "REQ-3",
      "text": "If retrying deployment fails with the same error, redeploy the last known successful build artifacts exactly as-is (no rebuild and no code changes).",
      "target": "unknown",
      "source": {
        "messageIds": [
          "project_state.json-20..27"
        ],
        "quotes": [
          "If the deployment retry fails with the same error, redeploy the last known successful build artifacts exactly as-is (no rebuild or code changes)."
        ]
      },
      "acceptanceCriteria": [
        "If the retry fails with the same error, the system attempts a fallback redeploy using the last known successful artifacts without rebuilding.",
        "Fallback redeploy does not modify any source code, assets, or configuration."
      ]
    },
    {
      "id": "REQ-4",
      "text": "If deployment still fails after retry and fallback redeploy attempts, capture and report the deployment failure details (error message and the step where it occurred) without making any code changes.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "project_state.json-28..35"
        ],
        "quotes": [
          "Capture and report the deployment failure details (error message and step where it occurred) if the retry still fails after attempting the fallback redeploy, without making any code changes."
        ]
      },
      "acceptanceCriteria": [
        "The reported output includes the failing deployment step/stage and the full error message.",
        "No code/content/config changes are made while collecting/reporting the failure details."
      ]
    }
  ],
  "constraints": [
    "Do not modify source code, static assets, canister logic, or user-facing content.",
    "Keep the exact same configuration as the current app.",
    "Backend must remain single-actor (no new canisters/services)."
  ],
  "nonGoals": [
    "Adding new features or changing UI/UX.",
    "Refactoring code, updating dependencies, or changing build configuration beyond what is strictly required to redeploy.",
    "Data/schema migrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}