{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fresh live redeploy playbook (no app changes)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Redeploy to a fresh live instance while keeping the app identical (no code/assets/config/content changes).",
      "acceptanceCriteria": [
        "A new live deployment is created (fresh instance) and is reachable via a live URL.",
        "No source code files, assets, or configuration values are modified as part of this change.",
        "The deployed app behavior and content match the prior live deployment (no functional or copy changes)."
      ],
      "file_operations": [
        {
          "path": "frontend/deployment/fresh-instance-redeploy.md",
          "operation": "create",
          "description": "Document the exact operational steps to redeploy the existing already-built frontend to a fresh live instance without modifying any application source, static assets, or configuration values; include verification steps to confirm the deployed UI/content matches the previous live instance byte-for-byte where applicable."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "If deployment fails after a successful build, retry deployment using the same build artifacts (no rebuild, no app changes).",
      "acceptanceCriteria": [
        "On deployment failure, the system performs at least one retry using the same build artifacts (no rebuild).",
        "The retry does not introduce any code/config/content changes."
      ],
      "file_operations": [
        {
          "path": "frontend/deployment/deploy-retry-policy.md",
          "operation": "create",
          "description": "Define the deployment retry procedure that explicitly reuses the current build artifacts (no rebuild) and prohibits any changes to frontend code, assets, or configuration values; include guidance on how to confirm the same artifact bundle is being redeployed."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "If retry fails with the same error, redeploy the last known successful build artifacts exactly as-is (no rebuild, no app changes).",
      "acceptanceCriteria": [
        "If the retry fails with the same error, the system attempts a fallback redeploy using the last known successful artifacts without rebuilding.",
        "Fallback redeploy does not modify any source code, assets, or configuration."
      ],
      "file_operations": [
        {
          "path": "frontend/deployment/fallback-last-known-good.md",
          "operation": "create",
          "description": "Document the fallback redeploy procedure that uses the last known successful frontend build artifacts exactly as-is (no rebuild) and includes checks to ensure the artifact set is unchanged before redeploying."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "If deployment still fails after retry and fallback, capture and report failure details without any code changes.",
      "acceptanceCriteria": [
        "The reported output includes the failing deployment step/stage and the full error message.",
        "No code/content/config changes are made while collecting/reporting the failure details."
      ],
      "file_operations": [
        {
          "path": "frontend/deployment/deploy-failure-reporting.md",
          "operation": "create",
          "description": "Specify what deployment failure details must be captured (full error message, failing step/stage, timestamps) and how to report them, explicitly ensuring no frontend code/assets/config/content changes are made as part of troubleshooting."
        }
      ]
    }
  ]
}